Tekla.Structures.Analysis.AnalysisSubSection
The AnalysisSubSection class contains information related to analysis subsections.

Tekla.Structures.Analysis.AnalysisSubSection._Type
Type of sub section.

Tekla.Structures.Analysis.AnalysisSubSection._SubType
Sub type of sub section.

Tekla.Structures.Analysis.AnalysisSubSection._Material
Material.

Tekla.Structures.Analysis.AnalysisSubSection._OffsetY
Offset Y.

Tekla.Structures.Analysis.AnalysisSubSection._OffsetZ
Offset Z.

Tekla.Structures.Analysis.AnalysisSubSection._OffsetAngle
Offset Angle.

Tekla.Structures.Analysis.AnalysisSubSection._B
B.

Tekla.Structures.Analysis.AnalysisSubSection._B1
B1.

Tekla.Structures.Analysis.AnalysisSubSection._B2
B2.

Tekla.Structures.Analysis.AnalysisSubSection._B3
B3.

Tekla.Structures.Analysis.AnalysisSubSection._B4
B4.

Tekla.Structures.Analysis.AnalysisSubSection._H
H.

Tekla.Structures.Analysis.AnalysisSubSection._H1
H1.

Tekla.Structures.Analysis.AnalysisSubSection._H2
H2.

Tekla.Structures.Analysis.AnalysisSubSection._R1
R1.

Tekla.Structures.Analysis.AnalysisSubSection._R2
R2.

Tekla.Structures.Analysis.AnalysisSubSection._T1
T1.

Tekla.Structures.Analysis.AnalysisSubSection._T2
T2.

Tekla.Structures.Analysis.AnalysisSubSection._T3
T3.

Tekla.Structures.Analysis.AnalysisSubSection._T4
T4.

Tekla.Structures.Analysis.AnalysisSubSection._TW
TW.

Tekla.Structures.Analysis.AnalysisSubSection._TF
TF.

Tekla.Structures.Analysis.AnalysisSubSection._IsHole
Is hole.

Tekla.Structures.Analysis.AnalysisSubSection._Points
Points.

Tekla.Structures.Analysis.AnalysisSubSection.B
The B value.

Tekla.Structures.Analysis.AnalysisSubSection.B1
The B1 value.

Tekla.Structures.Analysis.AnalysisSubSection.B2
The B2 value.

Tekla.Structures.Analysis.AnalysisSubSection.B3
The B3 value.

Tekla.Structures.Analysis.AnalysisSubSection.B4
The B4 value.

Tekla.Structures.Analysis.AnalysisSubSection.H
The H value.

Tekla.Structures.Analysis.AnalysisSubSection.H1
The H1 value.

Tekla.Structures.Analysis.AnalysisSubSection.H2
The H2 value.

Tekla.Structures.Analysis.AnalysisSubSection.IsHole
Defines whether the subsection is a hole.

Tekla.Structures.Analysis.AnalysisSubSection.Material
The material of the subsection.

Tekla.Structures.Analysis.AnalysisSubSection.OffsetAngle
The offset angle.

Tekla.Structures.Analysis.AnalysisSubSection.OffsetY
The offset in the direction of the Y-axis.

Tekla.Structures.Analysis.AnalysisSubSection.OffsetZ
The offset in the direction of the Z-axis.

Tekla.Structures.Analysis.AnalysisSubSection.Points
The points of the subsection.

Tekla.Structures.Analysis.AnalysisSubSection.R1
The R1 value.

Tekla.Structures.Analysis.AnalysisSubSection.R2
The R2 value.

Tekla.Structures.Analysis.AnalysisSubSection.SubType
The subtype of the subsection.

Tekla.Structures.Analysis.AnalysisSubSection.T1
The T1 value.

Tekla.Structures.Analysis.AnalysisSubSection.T2
The T2 value.

Tekla.Structures.Analysis.AnalysisSubSection.T3
The T3 value.

Tekla.Structures.Analysis.AnalysisSubSection.T4
The T4 value.

Tekla.Structures.Analysis.AnalysisSubSection.TF
The TF value.

Tekla.Structures.Analysis.AnalysisSubSection.TW
The TW value.

Tekla.Structures.Analysis.AnalysisSubSection.Type
The type of the subsection.

Tekla.Structures.Analysis.AnalysisSubSection.Insert
Inserts an analysis subsection.

Tekla.Structures.Analysis.AnalysisSubSection.Select
Selects an analysis subsection.
The analysis subsection identifier must be set.

Tekla.Structures.Analysis.AnalysisSubSection.InsertInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisSubSection.SelectInstance
DO NOT USE! For private usage only!

Tekla.Structures.Analysis.AnalysisSubSection.CollectData
Collects data.